console.log(" Общая оценка работы: 100/100");
console.log(" 1. Вёрстка страницы Main соответствует макету при ширине экрана 1280px: +14\n 2. Вёрстка страницы Main соответствует макету при ширине экрана 768px: +14\n 3. Вёрстка страницы Main соответствует макету при ширине экрана 320px: +14");
console.log(" 4. Вёрстка страницы Pets соответствует макету при ширине экрана 1280px: +6\n 5. Вёрстка страницы Pets соответствует макету при ширине экрана 768px: +6\n 6. Вёрстка страницы Pets соответствует макету при ширине экрана 320px: +6");
console.log(" 7. Ни на одном из разрешений не наблюдаются ошибки вёрстки. Белые полосы и горизонтальная прокрутка отсутствуют, весь контент согласно макету присутствует: +20");
console.log(" 8. Вёрстка резиновая. На странице main резиновость проявляется в виде хедера, параграфа в Not only, параграфов в About. На странице pets резиновость проявляется в виде хедера: +8");
console.log(" 9. При ширине экрана меньше 768px появляется иконка бургер-меню. Пока что по функционалу она пересылает с main на pets и обратно: +4");
console.log(" 10. Результат валидации обеих страниц: Document checking completed. No errors or warnings to show: +8");
console.log(" Если ты это читаешь, то удачного тебе дня!");